Revit 2027 API
SubTransaction Constructor
 Instantiates a sub-transaction object
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SubTransaction(
	Document document
)
Public Sub New (
	document As Document
)
public:
SubTransaction(
	Document^ document
)
new :
        document : Document -> SubTransaction
Parameters
document Document
 The document for which this sub-transaction is going to be used.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SubTransaction Class
Autodesk.Revit.DB Namespace